
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Приказ.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Приказ.Дата КАК Дата,
	|	Приказ.Номер КАК Номер,
	|	Приказ.Ректор КАК Ректор,
	|	Приказ.ПринимаемыеНаРаботу.(
	|		НомерСтроки КАК НомерСтроки,
	|		Сотрудник КАК Сотрудник,
	|		Сотрудник.Код КАК ТабельныйНомер,
	|		Сотрудник.Должность.Кафедра.Наименование КАК Кафедра,
	|		Сотрудник.Должность.Наименование КАК Должность,
	|		Сотрудник.Должность.Оклад КАК Оклад,
	|		Сотрудник.Должность.ДоляСтавки КАК ДоляСтавки,
	|		Сотрудник.ТрудовойДоговор.Номер КАК ТрудовойДоговор,
	|		Сотрудник.ТрудовойДоговор.НачалоСрока КАК НачалоСрока,
	|		Сотрудник.ТрудовойДоговор.ОкончаниеСрока КАК ОкончаниеСрока
	|	) КАК ПринимаемыеНаРаботу
	|ИЗ
	|	Документ.Приказ КАК Приказ
	|ГДЕ
	|	Приказ.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьКолонтитул = Макет.ПолучитьОбласть("Колонтитул");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПринимаемыеНаРаботуШапка = Макет.ПолучитьОбласть("ПринимаемыеНаРаботуШапка");
	ОбластьПринимаемыеНаРаботу = Макет.ПолучитьОбласть("ПринимаемыеНаРаботу");
	ОбластьМестоДляПодписи = Макет.ПолучитьОбласть("МестоДляПодписи");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьКолонтитул);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьПринимаемыеНаРаботуШапка);
		ВыборкаПринимаемыеНаРаботу = Выборка.ПринимаемыеНаРаботу.Выбрать();
		Пока ВыборкаПринимаемыеНаРаботу.Следующий() Цикл
			ОбластьПринимаемыеНаРаботу.Параметры.Заполнить(ВыборкаПринимаемыеНаРаботу);
			ТабДок.Вывести(ОбластьПринимаемыеНаРаботу, ВыборкаПринимаемыеНаРаботу.Уровень());
		КонецЦикла;

		ОбластьМестоДляПодписи.Параметры.Заполнить(Выборка);	
		ТабДок.Вывести(ОбластьМестоДляПодписи);
				
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
		//}}
КонецПроцедуры
