#Область ПрикладныеФункцииИПроцедуры
&НаСервере
Процедура ЗаполнитьТекстом()
	Элементы.ТекстСогласия.Заголовок = "Я, " + Объект.СубъектПерсональныхДанных.ПолноеИмя
									 + ", серия паспорта " + Объект.СубъектПерсональныхДанных.СерияПаспорта
									 + ", номер паспорта " + Объект.СубъектПерсональныхДанных.НомерПаспорта
									 + ", выдан " + Объект.СубъектПерсональныхДанных.ПаспортКемВыдан
									 + ", " + Объект.СубъектПерсональныхДанных.ПаспортКогдаВыдан
									 + ", адрес регистрации: " + Объект.СубъектПерсональныхДанных.АдресРегистрации + ", ";
									 
	Если Объект.ТекстСогласия = "" Тогда
		Элементы.ТекстСогласия.Заголовок = Элементы.ТекстСогласия.Заголовок
										 + Константы.ТекстСогласияНаОбработкуПерсональныхДанных.Получить();
	Иначе
		Элементы.ТекстСогласия.Заголовок = Элементы.ТекстСогласия.Заголовок
										 + Объект.ТекстСогласия;
	КонецЕсли;
КонецПроцедуры                   

&НаСервере
Процедура СкрытьТекст()
	Элементы.ГруппаТекстСоглашения.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекст()
	ЗаполнитьТекстом();
	Элементы.ГруппаТекстСоглашения.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьТекста()
	Если Объект.СубъектПерсональныхДанных.Пустая() Тогда
		СкрытьТекст();
	Иначе
		ПоказатьТекст();
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьДоступностьФормы()
	ЭтаФорма.ТолькоПросмотр = Объект.Подписан;
	ЭтаФорма.КоманднаяПанель.Доступность = Не Объект.Подписан;
КонецПроцедуры
#КонецОбласти                    

#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьТекста();
	ОбновитьДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура СубъектПерсональныхДанныхПриИзменении(Элемент)
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ТекстСогласия = Элементы.ТекстСогласия.Заголовок;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Сотрудник = ТекущийОбъект.СубъектПерсональныхДанных.ПолучитьОбъект();
	Сотрудник.СогласиеНаОбработкуПД = ТекущийОбъект.Ссылка;
	Сотрудник.Записать();
КонецПроцедуры
#КонецОбласти
