#Область ПрикладныеПроцедурыИФункции
Процедура ЗаполнитьТекстом()
	Если Объект.ТекстОбязанностиПреподавателя = "" Тогда
		Элементы.ТекстОбязанностиПреподавателя.Заголовок = Константы.ОбязанностиПреподавателя.Получить();
	Иначе
		Элементы.ТекстОбязанностиПреподавателя.Заголовок = Объект.ТекстОбязанностиПреподавателя;   
	КонецЕсли;      
									  
	Если Объект.ТекстОбязанностиРаботодателя = "" Тогда
		Элементы.ТекстОбязанностиРаботодателя.Заголовок = Константы.ОбязанностиРаботодателя.Получить();
	Иначе
		Элементы.ТекстОбязанностиРаботодателя.Заголовок = Объект.ТекстОбязанностиРаботодателя;   
	КонецЕсли;   
	
	Если Объект.ТекстТрудовыеПраваПреподавателя = "" Тогда
		Элементы.ТекстТрудовыеПраваПреподавателя.Заголовок = Константы.ТрудовыеПраваПреподавателя.Получить();
	Иначе
		Элементы.ТекстТрудовыеПраваПреподавателя.Заголовок = Объект.ТекстТрудовыеПраваПреподавателя;   
	КонецЕсли;   
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекст()
	ЗаполнитьТекстом();
	Элементы.ГруппаПраваИОбязанностиСторон.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура СкрытьТекст()
	Элементы.ГруппаПраваИОбязанностиСторон.Видимость = Ложь;
КонецПроцедуры

Процедура ОбновитьДоступностьФормы()
	ЭтаФорма.ТолькоПросмотр = Объект.Подписан;
	ЭтаФорма.КоманднаяПанель.Доступность = Не Объект.Подписан;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТекстом();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТекстом();
	ОбновитьДоступностьФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ТекстОбязанностиПреподавателя   = Элементы.ТекстОбязанностиПреподавателя.Заголовок;
	ТекущийОбъект.ТекстОбязанностиРаботодателя    = Элементы.ТекстОбязанностиРаботодателя.Заголовок;
	ТекущийОбъект.ТекстТрудовыеПраваПреподавателя = Элементы.ТекстТрудовыеПраваПреподавателя.Заголовок;
КонецПроцедуры

&НаСервере
Функция ПодписалДолжностнуюИнструкцию()
	Возврат Не Объект.Преподаватель.ДолжностнаяИнструкция.Пустая();
КонецФункции

&НаСервере
Функция ПодписалСогласиеНаОбработкуПД()
	Возврат Не Объект.Преподаватель.СогласиеНаОбработкуПД.Пустая();
КонецФункции  

&НаСервере
Функция ПодписалОбязательствоСоблюденияРКПД()
	Возврат Не Объект.Преподаватель.ОбязательствоСоблюденияРКПД.Пустая() 
		  И Не Объект.Преподаватель.ОбязательствоСоблюденияРКПД.Ссылка = Неопределено;
КонецФункции

&НаКлиенте
Функция ДокументыПодписаны()
	Если Не ПодписалСогласиеНаОбработкуПД() Тогда
		ПоказатьПредупреждение( , "Сотрудник не подписал согласие на "
								+ "обработку персональных данных."
								, , "Ошибка формирования договора.");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПодписалОбязательствоСоблюденияРКПД() Тогда
		ПоказатьПредупреждение( , "Сотрудник не подписал обязательство соблюдения "
								+ "режима конфиденциальности персональных данных."
								, , "Ошибка формирования договора.");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПодписалДолжностнуюИнструкцию() Тогда
		ПоказатьПредупреждение( , "Сотрудник не подписал должностную инструкцию. "
								, , "Ошибка формирования договора.");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПреподавательПриИзменении(Элемент)
	// Pass
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = Не ДокументыПодписаны();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Преподаватель = Объект.Преподаватель.ПолучитьОбъект();
	
	Попытка
		Преподаватель.Заблокировать();
		Преподаватель.ТрудовойДоговор = ТекущийОбъект.Ссылка;
		Преподаватель.Записать();
		Преподаватель.Разблокировать();
	Исключение
		Сообщить("В данный момент невозможно передать ссылку на этот договор в личный кабинет сотрудника. Попробуйте позже", СтатусСообщения.Важное);  
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент()
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, Закрыть", РежимЗаписиДокумента.Запись, Ложь); 
	Записать(ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗаписать(Команда)
	ЗаписатьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗаписатьИЗакрыть(Команда)
	ЗаписатьДокумент();
	Закрыть();
КонецПроцедуры
#КонецОбласти