#Область ОбработчикиСобытий
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого СтрокаСотрудника Из Объект.ПринимаемыеНаРаботу Цикл
		Попытка
			СотрудникОбъект = СтрокаСотрудника.Сотрудник.ПолучитьОбъект();
			
			СотрудникОбъект.Заблокировать();
			СотрудникОбъект.ПринятНаРаботу = Истина; 
			СотрудникОбъект.ПриказОПриеме  = ТекущийОбъект.Ссылка;
			СотрудникОбъект.Записать();
			СотрудникОбъект.Разблокировать();
		Исключение
			Сообщить("Не удалось передать ссылку в личный кабинет сотрудника " 
					+ СотрудникОбъект.Наименование + ".", СтатусСообщения.Важное);
		КонецПопытки;
	КонецЦикла;  
	Объект.Подписан = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаТрудовойДоговор(СсылкаНаСотрудника)
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТрудовойДоговор.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ТрудовойДоговор КАК ТрудовойДоговор
	|ГДЕ
	|	ТрудовойДоговор.Преподаватель = &СотрудникСсылка";
	
	Запрос.УстановитьПараметр("СотрудникСсылка", СсылкаНаСотрудника);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если Не РезультатЗапроса.Следующий() Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ТрудовойДоговорСсылка = РезультатЗапроса.Получить(0);	
	Возврат ТрудовойДоговорСсылка;
КонецФункции

&НаКлиенте
Функция ЕстьДубликаты(СсылкаНаСотрудника, ТекущаяСтрока)
	Для Каждого СтрокаТабЧасти Из Объект.ПринимаемыеНаРаботу Цикл
		Если СтрокаТабЧасти.ПолучитьИдентификатор() = ТекущаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТабЧасти.Сотрудник = СсылкаНаСотрудника Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ПринимаемыеНаРаботуСотрудникПриИзменении(Элемент)
	СсылкаНаСотрудника = Элементы.ПринимаемыеНаРаботу.ТекущиеДанные.Сотрудник;
	ТекущаяСтрока      = Элементы.ПринимаемыеНаРаботу.ТекущаяСтрока;
	
	Если ЕстьДубликаты(СсылкаНаСотрудника, ТекущаяСтрока) Тогда
		ПоказатьПредупреждение( , "Вы уже добавили этого сотрудника в приказ", , "Ошибка Формирования приказа");
		Возврат;
	КонецЕсли;
	
	ТрудовойДоговорСсылка = ПолучитьСсылкуНаТрудовойДоговор(СсылкаНаСотрудника);  
	
	Если ТрудовойДоговорСсылка = Неопределено Тогда
		ПоказатьПредупреждение( , "Трудовой договор с этим сотрудником не был заключен.", , "Ошибка формирования приказа");  
		Возврат;
	КонецЕсли;
	
	Элементы.ПринимаемыеНаРаботу.ТекущиеДанные.ТрудовойДоговор = ТрудовойДоговорСсылка;
КонецПроцедуры

Процедура ОбновитьДоступностьФормы()
	ЭтаФорма.ТолькоПросмотр = Объект.Подписан;
	ЭтаФорма.КоманднаяПанель.Доступность = Не Объект.Подписан;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДоступностьФормы();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика
	
	Для Каждого СтрТаб Из Объект.ПринимаемыеНаРаботу Цикл
		Если СтрТаб.ТрудовойДоговор.Подписан = Ложь Тогда
			//ПоказатьПредупреждение( , "Сотрудник " + СтрТаб.Сотрудник.Наименование + " не подписал трудовой договор.", 
			//						, "Ошибка проведения");
			Сообщить("Сотрудник " + СтрТаб.Сотрудник.Наименование + " не подписал трудовой договор.");
			Отказ = Истина;
			Возврат;	
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры
#КонецОбласти
