&НаКлиенте
Процедура ОткрытьЛКТекущегоСотрудника() Экспорт
	СотрудникСсылка = УправлениеУчетнымиЗаписями.ПолучитьСотрудника(УправлениеУчетнымиЗаписями.ИмяТекущегоПользователя());
	
	Если СотрудникСсылка = Неопределено Тогда
		ПоказатьПредупреждение( , "Личного кабинета для данной учетной записи не существует.",
								, "Ошибка открытия личного кабинета.");
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура("Ключ", СотрудникСсылка);
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлементаДляСотрудника", Параметры, , "ОкноЛК", );
КонецПроцедуры
