#Область ОбшийИнтерфейс
&НаСервере
Функция СгенерироватьНаименование(СсылкаНаОбъект)
	Наименование = "ТРЕБ."
				 + ВРег(Объект.ДолжностьПоШтатномуРасписанию
				              .ТипДолжности
				              .СокращенноеНаименование)
				 + ВРег(Объект.ДолжностьПоШтатномуРасписанию
				              .Кафедра
				              .Наименование);
	Возврат Наименование;
КонецФункции
#КонецОбласти

#Область ОбработчикиСобытий
&НаСервере
Процедура ДолжностьПоШтатномуРасписаниюПриИзмененииНаСервере()
	Объект.Наименование = СгенерироватьНаименование(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПоШтатномуРасписаниюПриИзменении(Элемент)
	ДолжностьПоШтатномуРасписаниюПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
	Объект.Наименование = СгенерироватьНаименование(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
#КонецОбласти