#Область ПрикладныеФункцииИПроцедуры
&НаСервере
Процедура ЗаполнитьТекстом()
	Элементы.ДекорацияТекстОбязательства.Заголовок = "Я, " + Объект.Подписант.ПолноеИмя
									      + ", серия паспорта " + Объект.Подписант.СерияПаспорта
									 	  + ", номер паспорта " + Объект.Подписант.НомерПаспорта
									 	  + ", выдан " + Объект.Подписант.ПаспортКемВыдан
									 	  + ", " + Объект.Подписант.ПаспортКогдаВыдан
									 	  + ", адрес регистрации: " + Объект.Подписант.АдресРегистрации + ", ";
	Если Объект.ТекстОбязательства = "" Тогда
		Элементы.ДекорацияТекстОбязательства.Заголовок = Элементы.ДекорацияТекстОбязательства.Заголовок
									      + Константы.ТекстОбязательстваКонфПД.Получить();
	Иначе
		Элементы.ДекорацияТекстОбязательства.Заголовок = Элементы.ДекорацияТекстОбязательства.Заголовок
										  + Объект.ТекстОбязательства;   
	КонецЕсли;      
									  
	Если Объект.ТекстПоложения = "" Тогда
   		Элементы.ДекорацияТекстПоложения.Заголовок = Константы.ТекстПоложенияОЗащитеПД.Получить();
	Иначе
		Элементы.ДекорацияТекстПоложения.Заголовок = Объект.ТекстПоложения;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекст()
	ЗаполнитьТекстом();
	Элементы.Страницы.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура СкрытьТекст()
	Элементы.Страницы.Видимость = Ложь;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьТекста()
	Если Объект.Подписант.Пустая() Тогда
		СкрытьТекст();
	Иначе
		ПоказатьТекст();
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьДоступностьФормы()
	ЭтаФорма.ТолькоПросмотр = Истина;
	ЭтаФорма.КоманднаяПанель.Доступность = Не Объект.Подписан;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Подписант") Тогда
		Объект.Подписант = Параметры.Подписант;
	КонецЕсли;
	
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьТекста();
	ОбновитьДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ТекстОбязательства = Элементы.ДекорацияТекстОбязательства.Заголовок;
	Объект.ТекстПоложения     = Элементы.ДекорацияТекстПоложения.Заголовок;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ДобавитьВЛичныйКабинет();
КонецПроцедуры

&НаСервере
Процедура ДобавитьВЛичныйКабинет()
	Сотрудник = Объект.Подписант.ПолучитьОбъект();
	Попытка
		Сотрудник.Заблокировать();
		Сотрудник.ОбязательствоСоблюденияРКПД = Объект.Ссылка;
		Сотрудник.Записать();
		Сотрудник.Разблокировать();
	Исключение
		Сообщить("Объект сейчас используется. Попробуйте позже.", СтатусСообщения.Важное);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьПодпись()
	Объект.Подписан = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент()
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, Закрыть", РежимЗаписиДокумента.Проведение, Ложь);
	Записать(ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаПодписать(Команда)
	ПоставитьПодпись();
	ПровестиДокумент();
	ОбновитьДоступностьФормы();
КонецПроцедуры     

&НаКлиенте
Процедура КнопкаПодписатьИЗакрыть(Команда)
	ПоставитьПодпись();
	ПровестиДокумент();
	Закрыть();
КонецПроцедуры
#КонецОбласти