#Область ФункцииДляРаботыСоСтроками
Функция ПолучитьФиоСИнициалами(ПолноеИмя) Экспорт
	МассивПодстрок = СтрРазделить(СокрЛП(ПолноеИмя), " ", Ложь);
	Фамилия = МассивПодстрок.Получить(0);
	ИнициалИмени = Лев(МассивПодстрок.Получить(1), 1) + ".";

	Инициалы = Фамилия;    
	
	МассивПодстрок.Удалить(0);
	
	Для Каждого ЧастьИмени Из МассивПодстрок Цикл
		Инициалы = Инициалы + " " + Лев(ЧастьИмени, 1) + ".";
	КонецЦикла;
	
	Возврат Инициалы;
КонецФункции                       

Функция ПолучитьАббревиатуруПоПервымДвумБуквам(Строка) Экспорт
	МассивПодстрок = СтрРазделить(ТРег(СокрЛП(Строка)), " ", Ложь);
	Инициалы = "";
	
	Для Каждого ЧастьСтроки Из МассивПодстрок Цикл
		Инициалы = Инициалы + Лев(ЧастьСтроки, 2);		
	КонецЦикла;
	Возврат Инициалы;
КонецФункции
#КонецОбласти                   

#Область ОбработкаПеречислений
Функция УченоеЗваниеВЧисло(УченоеЗвание) Экспорт
	Если УченоеЗвание = Перечисления.УченоеЗвание.Профессор Тогда
		Возврат 2;
	ИначеЕсли УченоеЗвание = Перечисления.УченоеЗвание.Доцент Тогда
		Возврат 1;
	КонецЕсли;
	
	Возврат 0;
КонецФункции

Функция УченаяСтепеньВЧисло(УченаяСтепень) Экспорт
	Если УченаяСтепень = Перечисления.УченаяСтепень.ДокторНаук Тогда
		Возврат 2;
	ИначеЕсли УченаяСтепень = Перечисления.УченаяСтепень.КандидатНаук Тогда
		Возврат 1;
	КонецЕсли;
	
	Возврат 0;
КонецФункции
#КонецОбласти
