#Область ПрикладныеФункцииИПроцедуры
&НаСервере
Процедура ЗаполнитьТекстом()
	Если Объект.ТекстДолжностнойИнструкции = "" Тогда
		Элементы.ДекорацияТекстДИ.Заголовок = Объект.Подписант.Должность.ДолжностнаяИнструкция;
	Иначе
		Элементы.ДекорацияТекстДИ.Заголовок = Объект.ТекстДолжностнойИнструкции;   
	КонецЕсли;
	
	Элементы.ДекорацияНазваниеВУЗа.Заголовок = Константы.НаименованиеВУЗа.Получить();
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекст()
	ЗаполнитьТекстом();
	Элементы.ГруппаПоложенияДолжностнойИнструкции.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура СкрытьТекст()
	Элементы.ГруппаПоложенияДолжностнойИнструкции.Видимость = Ложь;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьТекста()
	Если Объект.Подписант.Должность.Пустая() Тогда
		СкрытьТекст();
	Иначе
		ПоказатьТекст();
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьДоступностьФормы()
	ЭтаФорма.ТолькоПросмотр = Объект.Подписан;
	ЭтаФорма.КоманднаяПанель.Доступность = Не Объект.Подписан;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьВидимостьТекста();  
	ОбновитьДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ТекстДолжностнойИнструкции = Элементы.ДекорацияТекстДИ.Заголовок;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Сотрудник = ТекущийОбъект.Подписант.ПолучитьОбъект();
	Сотрудник.ДолжностнаяИнструкция = ТекущийОбъект.Ссылка;
	Сотрудник.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	ОбновитьВидимостьТекста();
КонецПроцедуры
#КонецОбласти