
&НаСервере
Процедура ПриОткрытииНаСервере()
	//Если УправлениеУчетнымиЗаписями.ЭтоАдминистратор(ПараметрыСеанса.ИмяПользователя) Тогда
	//	Список.ТекстЗапроса =
	//	"ВЫБРАТЬ
	//	|	Сотрудники.Наименование КАК Наименование,
	//	|	Сотрудники.ПолноеИмя КАК ПолноеИмя,
	//	|	Сотрудники.ДатаРождения КАК ДатаРождения
	//	|ИЗ
	//	|	Справочник.Сотрудники КАК Сотрудники";	
	//	Возврат;	
	//КонецЕсли;
	//	
	//Список.ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	Сотрудники.Наименование КАК Наименование,
	//|	Сотрудники.ПолноеИмя КАК ПолноеИмя,
	//|	Сотрудники.ДатаРождения КАК ДатаРождения
	//|ИЗ
	//|	Справочник.Сотрудники КАК Сотрудники
	//|ГДЕ
	//|	Сотрудники.ИмяПользователя ПОДОБНО &ИмяПользователя";
	//
	//Список.Параметры.УстановитьЗначениеПараметра("ИмяПользователя", ПараметрыСеанса.ИмяПользователя);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
