#Область ПрикладныеФункцииИПроцедуры
&НаСервере
Процедура ЗаполнитьТекстом()
	Элементы.ДекорацияТекстОбязательства.Заголовок = "Я, " + Объект.Подписант.ПолноеИмя
									      + ", серия паспорта " + Объект.Подписант.СерияПаспорта
									 	  + ", номер паспорта " + Объект.Подписант.НомерПаспорта
									 	  + ", выдан " + Объект.Подписант.ПаспортКемВыдан
									 	  + ", " + Объект.Подписант.ПаспортКогдаВыдан
									 	  + ", адрес регистрации: " + Объект.Подписант.АдресРегистрации + ", ";
	Если Объект.ТекстОбязательства = "" Тогда
		Элементы.ДекорацияТекстОбязательства.Заголовок = Элементы.ДекорацияТекстОбязательства.Заголовок
									      + Константы.ТекстОбязательстваКонфПД.Получить();
	Иначе
		Элементы.ДекорацияТекстОбязательства.Заголовок = Элементы.ДекорацияТекстОбязательства.Заголовок
										  + Объект.ТекстОбязательства;   
	КонецЕсли;      
									  
	Если Объект.ТекстПоложения = "" Тогда
   		Элементы.ДекорацияТекстПоложения.Заголовок = Константы.ТекстПоложенияОЗащитеПД.Получить();
	Иначе
		Элементы.ДекорацияТекстПоложения.Заголовок = Объект.ТекстПоложения;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекст()
	ЗаполнитьТекстом();
	Элементы.Страницы.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура СкрытьТекст()
	Элементы.Страницы.Видимость = Ложь;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьТекста()
	Если Объект.Подписант.Пустая() Тогда
		СкрытьТекст();
	Иначе
		ПоказатьТекст();
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьДоступностьФормы()
	ЭтаФорма.ТолькоПросмотр = Объект.Подписан;
	ЭтаФорма.КоманднаяПанель.Доступность = Не Объект.Подписан;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьТекста();
	ОбновитьДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ТекстОбязательства = Элементы.ДекорацияТекстОбязательства.Заголовок;
	Объект.ТекстПоложения     = Элементы.ДекорацияТекстПоложения.Заголовок;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Сотрудник = Объект.Подписант.ПолучитьОбъект();
	Сотрудник.ОбязательствоСоблюденияРКПД = ТекущийОбъект.Ссылка;
	Сотрудник.Записать();
КонецПроцедуры
#КонецОбласти