
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		// Заполнение шапки
		Гражданство = ДанныеЗаполнения.Гражданство;
		ДатаРождения = ДанныеЗаполнения.ДатаРождения;
		ЖелаемаяДолжность = ДанныеЗаполнения.ЖелаемаяДолжность;
		ОСебе = ДанныеЗаполнения.ОСебе;
		Пол = ДанныеЗаполнения.Пол;
		ПолноеИмя = ДанныеЗаполнения.ПолноеИмя;
		ПослевузовскоеОбразование = ДанныеЗаполнения.ПослевузовскоеОбразование;
		СогласиеНаОбработкуПД = ДанныеЗаполнения.СогласиеНаОбработкуПД;
		Стаж = ДанныеЗаполнения.Стаж;
		УченаяСтепень = ДанныеЗаполнения.УченаяСтепень;
		Для Каждого ТекСтрокаОбразование Из ДанныеЗаполнения.Образование Цикл
			НоваяСтрока = Образование.Добавить();
			НоваяСтрока.АдресУЗ = ТекСтрокаОбразование.АдресУЗ;
			НоваяСтрока.ГодОкончанияИлиУхода = ТекСтрокаОбразование.ГодОкончанияИлиУхода;
			НоваяСтрока.ГодПоступления = ТекСтрокаОбразование.ГодПоступления;
			НоваяСтрока.КурсПриОкончанииИлиУходе = ТекСтрокаОбразование.КурсПриОкончанииИлиУходе;
			НоваяСтрока.НаименовниеУЗ = ТекСтрокаОбразование.НаименовниеУЗ;
			НоваяСтрока.НомерДипломаУдостоверения = ТекСтрокаОбразование.НомерДипломаУдостоверения;
			НоваяСтрока.СерияДипломаУдостоверения = ТекСтрокаОбразование.СерияДипломаУдостоверения;
			НоваяСтрока.Специальность = ТекСтрокаОбразование.Специальность;
			НоваяСтрока.ФакультетИлиОтделение = ТекСтрокаОбразование.ФакультетИлиОтделение;
		КонецЦикла;
		Для Каждого ТекСтрокаСписокМестРаботы Из ДанныеЗаполнения.СписокМестРаботы Цикл
			НоваяСтрока = СписокМестРаботы.Добавить();
			НоваяСтрока.АдресОрганизации = ТекСтрокаСписокМестРаботы.АдресОрганизации;
			НоваяСтрока.Должность = ТекСтрокаСписокМестРаботы.Должность;
			НоваяСтрока.МесяцИГодПоступления = ТекСтрокаСписокМестРаботы.МесяцИГодПоступления;
			НоваяСтрока.МесяцИГодУхода = ТекСтрокаСписокМестРаботы.МесяцИГодУхода;
			НоваяСтрока.НаименованиеОрганизации = ТекСтрокаСписокМестРаботы.НаименованиеОрганизации;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
