&НаКлиенте
Процедура КнопкаПерейтиВЛК(Команда)	
	
	СотрудникСсылка = ПолучитьСотрудника(ПолучитьИмяТекущегоПользователя());
	
	Если СотрудникСсылка = Неопределено Тогда
		ПоказатьПредупреждение( , "Личного кабинета для данной учетной записи не существует.",
								, "Ошибка открытия личного кабинета.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", СотрудникСсылка);
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлементаДляСотрудника", ПараметрыФормы, , "ОкноЛК", );
КонецПроцедуры          

&НаСервере
Функция ПолучитьИмяТекущегоПользователя()
	Возврат УправлениеУчетнымиЗаписями.ИмяТекущегоПользователя();
КонецФункции

&НаСервере
Функция ПолучитьСотрудника(Имя)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИмяПользователя ПОДОБНО &ИмяПользователя";
	
	Запрос.УстановитьПараметр("ИмяПользователя", Имя);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не Результат.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СотрудникСсылка = Результат.Получить(0);
	Возврат СотрудникСсылка;	
КонецФункции