#Область СлужебныеПроцедурыИФункции      
&НаСервере
Процедура ОбновитьНаименованиеОбъектаНаСервере(ЕстьКафедра = Истина)
	Объект.Наименование = Объект.ТипДолжности.Наименование;
	Если ЕстьКафедра Тогда
		Объект.Наименование = Объект.Наименование + " каф. "
							+ Объект.Кафедра.Наименование;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Кафедра.Пустая() Тогда
		ОбновитьНаименованиеОбъектаНаСервере(Ложь);
	Иначе
		ОбновитьНаименованиеОбъектаНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтандартнымТекстом(Команда)
	Если Не Объект.ДолжностнаяИнструкция = "" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение ,"Вы действительно хотите перезаписать "
					  + "поле должностной инструкции стандартным "
					  + "значением?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, 
					    "Заполнение", ); 	
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСтандартнымТекстомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтандартнымТекстомНаСервере()
	Объект.ДолжностнаяИнструкция = Константы.ТекстДолжностнаяИнструкция.Получить(); 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(РезультатВопроса, ДополнительныйПараметр) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСтандартнымТекстомНаСервере();
КонецПроцедуры;
#КонецОбласти
