#Область ОбщийИнтерфейс
#КонецОбласти

#Область ОбработчикиСобытий
&НаКлиенте
Процедура Пригласить(Команда)
	ПригласитьНаСервере();
	ЗаписатьИПровести();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПригласитьНаСервере()     
	#Область СозданиеПриглашения
	РежимПроведения    = РежимПроведенияДокумента.Неоперативный;
	РежимЗаписи        = РежимЗаписиДокумента.Проведение;
	
	Приглашение        = Документы.Приглашение.СоздатьДокумент();
	Приглашение.Дата   = Объект.Дата;
	Приглашение.Заявка = Объект.Заявка;
	Приглашение.Записать(РежимЗаписи, РежимПроведения);
	#КонецОбласти
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИПровести()
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	Записать(ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура Отказать(Команда)
	ОтказатьНаСервере();
	ЗаписатьИПровести();
	ЭтаФорма.Закрыть();
КонецПроцедуры  

&НаСервере
Процедура ОтказатьНаСервере()
	РежимПроведения    = РежимПроведенияДокумента.Неоперативный;
	РежимЗаписи        = РежимЗаписиДокумента.Проведение;

	Отказ = Документы.Отказ.СоздатьДокумент();
	Отказ.Дата = Объект.Дата;
	Отказ.Заявка = Объект.Заявка;
	Отказ.Записать(РежимЗаписи, РежимПроведения);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьФормы()
	ЭтаФорма.КоманднаяПанель.Доступность = Не Объект.Проведен;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДоступностьФормы();
КонецПроцедуры
#КонецОбласти
